results/2/bench-c64-i2048o512.log

Throughput
note: saving the result JSON to /root/inference-poc/results/2/result-c64-i2048o512.json
note: sampling GPU temperature and power every 2s -> /root/inference-poc/results/2/gpu_thermals.csv
Warning: You are sending unauthenticated requests to the HF Hub. Please set a HF_TOKEN to enable higher rate limits and faster downloads.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x748a4dbf05e0>, trust_remote_code=False, seed=0, num_prompts=512, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=2048, random_output_len=512, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai-chat', base_url=None, host='localhost', port=8000, endpoint='/v1/chat/completions', header=None, max_concurrency=64, model='deepseek-ai/DeepSeek-V4-Pro-0813', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, probe_request_rate=0.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=['ignore_eos=1', 'random_range_ratio=0.0'], result_dir=None, result_filename='/root/inference-poc/results/2/result-c64-i2048o512.json', ignore_eos=True, self_timed=None, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='99', goodput=None, request_id_prefix='bench-1b6adf34-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 08-17 03:59:43 [config.py:774] Detected quantization_config.scale_fmt=ue8m0; enabling UE8M0 for DeepGEMM.
INFO 08-17 03:59:44 [utils.py:90] Sampling input_len from [2048, 2048] and output_len from [512, 512]
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 64
100%|██████████| 512/512 [04:44<00:00,  1.80it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     512       
Failed requests:                         0         
Maximum request concurrency:             64        
Benchmark duration (s):                  284.86    
Total input tokens:                      1050624   
Total generated tokens:                  262144    
Request throughput (req/s):              1.80      
Output token throughput (tok/s):         920.27    
Peak output token throughput (tok/s):    691.00    
Peak concurrent requests:                71.00     
Total token throughput (tok/s):          4608.55   
---------------Time to First Token----------------
Mean TTFT (ms):                          1558.44   
Median TTFT (ms):                        666.47    
P99 TTFT (ms):                           13207.06  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          64.64     
Median TPOT (ms):                        64.24     
P99 TPOT (ms):                           110.14    
---------------Inter-token Latency----------------
Mean ITL (ms):                           144.02    
Median ITL (ms):                         94.23     
P99 ITL (ms):                            544.58    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          34588.07  
Median E2EL (ms):                        34198.44  
P99 E2EL (ms):                           58108.55  
---------------Speculative Decoding---------------
Acceptance rate (%):                     16.93     
Acceptance length:                       2.19      
Drafts:                                  120020    
Draft tokens:                            840140    
Accepted tokens:                         142262    
Per-position acceptance (%):
  Position 0:                            51.33     
  Position 1:                            28.19     
  Position 2:                            16.53     
  Position 3:                            10.12     
  Position 4:                            6.46      
  Position 5:                            3.88      
  Position 6:                            2.03      
==================================================